Revit 2024 API
BuiltInFailures.GroupFailures.AtomTouchedNotAllowed Property
 Changes to groups are only allowed during Edit Group mode. Use Edit Group to make this change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AtomTouchedNotAllowed { get; }
Visual Basic
Public Shared ReadOnly Property AtomTouchedNotAllowed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AtomTouchedNotAllowed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace